<template>
  <div class="callback" :class="{ callbackShow: $store.state.policy.show }" >
    <div class="callback-bg" @click="$store.commit('policy/hiddenPopup')" ></div>
    <div class="callback-wrapper">
      <div class="callback-top">
        <div class="top-close">
          <img src="~/assets/img/close.svg" @click="$store.commit('policy/hiddenPopup')"  alt="">
        </div>
        <div class="top-title">
          <span v-if="lang === 'ru'">Политика конфиденциальности</span>
          <span v-if="lang === 'en'">Политика конфиденциальности</span>
          <span v-if="lang === 'port'">Политика конфиденциальности</span>
        </div>
      </div>
      <div class="callback-form">
        <div class="text">

          Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт ООО_официальное название компании_, расположенный на доменном имени www.__, может получить о Пользователе во время использования сайта www.__, программ и продуктов этого сайта.
          Мы собираем, используем и охраняем персональные данные, которые Вы предоставляете нам при использовании нашего сайта (далее – «сайт») с любого устройства и при коммуникации с нами в любой форме, в соответствии с данной Политикой.
          Используя наш сайт и предоставляя нам свои персональные данные, Вы даете согласие на обработку Ваших персональных данных в соответствии с данной Политикой.

          1. Основные понятия

          «Персональные данные» – любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу.

          «Обработка персональных данных» – осуществление любых действий или совокупности действий в отношении Ваших персональных данных, включая сбор, запись, систематизацию, накопление, хранение, обновление и изменение, извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение, как с использованием, так и без использования систем автоматизированной обработки персональных данных.

          2. Данные, которые мы собираем

          Мы собираем:

          персональные данные, которые Вы предоставляете нам при заполнении информационных полей на нашем сайте, в том числе при заполнении контактной формы, при подписке на новостную рассылку, при регистрации на мероприятия;
          персональные данные и другую информацию, содержащуюся в сообщениях, которые Вы нам направляете;
          персональные данные, которые Вы предоставляете через наш сайт вакансий и стажировок;
          технические данные, которые автоматически передаются устройством, с помощью которого Вы используете наш сайт, в том числе технические характеристики устройства, IP-адрес, информация, сохраненная в файлах «cookies», которые были отправлены на Ваше устройство, информация о браузере, дата и время доступа к сайту, адреса запрашиваемых страниц и иная подобная информация;
          иные данные о Вас, которые Вы пожелали оставить на нашем сайте.
          3. Цели обработки данных

          Мы обрабатываем Ваши персональные данные исключительно для тех целей, для которых они были предоставлены, в том числе:

          предоставления Вам информации о Компании, наших услугах и мероприятиях;
          осуществление приема и отправки заказа on-line;
          коммуникации с Вами, когда Вы обращаетесь к нам;
          организации Вашего участия в проводимых нами мероприятиях и опросах;
          направления Вам наших новостных материалов;
          выполнения полномочий и обязанностей, возложенных на Компанию законодательством Российской Федерации;
          для других целей с Вашего согласия.
          Мы обрабатываем технические данные для:

          обеспечения функционирования и безопасности нашем сайте;
          улучшения качества нашего сайта.
          Мы не размещаем Ваши персональные данные в общедоступных источниках. Мы не принимаем решений, порождающих для Вас юридические последствия или иным образом затрагивающих Ваши права и законные интересы на основании исключительно автоматизированной обработки персональных данных.

          4. Ваши права

          Обеспечение защиты Ваших прав и свобод в сфере персональных данных – важное условие работы Компании.

          Чтобы обеспечить защиту Ваших прав и свобод, по Вашей просьбе мы:

          подтвердим, обрабатываем ли мы Ваши персональные данные и предоставим Вам возможность с ними ознакомиться в течение 30 дней с даты получения Вашего запроса;
          сообщим Вам об источнике получения и составе Ваших персональных данных, которые мы обрабатываем;
          сообщим Вам о правовых основаниях, целях, сроках и способах обработки Ваших персональных данных;
          внесем необходимые изменения в Ваши персональные данные, если Вы подтвердите, что они неполные, неточные или неактуальные, в течение 7 рабочих дней с даты получения подтверждения, и уведомим Вас о внесенных изменениях;
          сообщим Вам об осуществленной или о предполагаемой трансграничной передаче Ваших персональных данных;
          сообщим Вам наименование и место нахождения организаций, которые имеют доступ к Вашим персональным данным и которым могут быть раскрыты Ваши персональные данные с Вашего согласия;
          сообщим Вам наименование или фамилию, имя, отчество и адрес лиц, которым с Вашего согласия может быть поручена обработка Ваших персональных данных; уведомим Вас о порядке осуществления Ваших прав при обработке нами Ваших персональных данных;
          исключим Вас из рассылки наших новостных материалов;
          прекратим обработку Ваших персональных данных в течение 30 дней с даты получения отзыва согласия, если для обработки персональных данных не будет иных правовых оснований, предусмотренных законодательством Российской Федерации;
          прекратим обработку Ваших персональных данных, если будет подтверждено, что мы их обрабатываем неправомерно, и уведомим Вас о предпринятых мерах;
          уничтожим Ваши персональные данные, если будет подтверждено, что они незаконно получены или не соответствуют заявленным целям обработки, в течение 7 рабочих дней с даты получения соответствующего подтверждения, и уведомим Вас о предпринятых мерах;
          ответим на Ваши вопросы, касающиеся Ваших персональных данных, которые мы обрабатываем.
          5. Как Вы можете связаться с нами

          Вы можете обратиться к нам с запросом, касающимся обработки Ваших персональных данных, направив нам письмо через форму обратной связи с темой письма «Запрос о персональных данных» (либо «Отзыв согласия на обработку персональных данных» в случае отзыва согласия на обработку персональных данных).

          6. Безопасность персональных данных

          Для обеспечения безопасности Ваших персональных данных при их обработке мы принимаем необходимые и достаточные правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, их уничтожения, изменения, блокирования, копирования, предоставления, распространения, а также от иных неправомерных действий в отношении персональных данных.

          В целях обеспечения адекватной защиты Ваших персональных данных мы проводим оценку вреда, который может быть причинен в случае нарушения безопасности Ваших персональных данных, а также определяем актуальные угрозы безопасности Ваших персональных данных при их обработке в информационных системах персональных данных.

          В Компании приняты локальные акты по вопросам безопасности персональных данных. Сотрудники Компании, имеющие доступ к персональным данным, ознакомлены с настоящей Политикой и локальными актами по вопросам безопасности персональных данных.

          7. Прекращение обработки персональных данных

          Мы прекращаем обработку Ваших персональных данных:

          при наступлении условий прекращения обработки персональных данных или по истечении установленных сроков;
          по достижении целей их обработки либо в случае утраты необходимости в достижении этих целей;
          по Вашему требованию, если обрабатываемые персональные данные являются незаконно полученными или не являются необходимыми для заявленной цели обработки;
          в случае выявления неправомерной обработки персональных данных, если обеспечить правомерность обработки невозможно;
          по истечении срока действия Вашего согласия на обработку персональных данных или в случае отзыва Вами такого согласия, если для обработки персональных данных не будет иных правовых оснований, предусмотренных законодательством Российской Федерации; в случае ликвидации Компании.
          8. Cookies

          Мы используем файлы «cookies». Файлы «cookies» – это небольшие текстовые файлы, размещаемые на жестких дисках Ваших устройств во время использования различных сайтов, предназначенные для содействия в настройке пользовательского интерфейса в соответствии с Вашими предпочтениями.

          Большинство браузеров позволяют отказаться от получения файлов «cookies» и удалить их с жесткого диска устройства.

          9. Ссылки на сайты третьих лиц

          На нашем сайте могут быть размещены ссылки на сторонние сайты и службы, которые мы не контролируем. Мы не несем ответственности за безопасность или конфиденциальность любой информации, собираемой сторонними сайтами или службами.

          10. Изменение Политики

          Мы можем обновлять Политику по мере необходимости. Мы рекомендуем Вам периодически проверять актуальность данной Политики. Продолжая пользоваться нашим сайтом после изменения Политики, Вы подтверждаете согласие с внесенными изменениями.
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Policy",
  props: ['lang'],
}
</script>

<style lang="less" scoped>
.callbackShow{
  visibility: visible !important;
  opacity: 1 !important;
}
.callback{
  position: fixed;
  left: 0;
  top: 0;
  width: 100%;
  height: 100%;
  z-index: 100;
  display: flex;
  align-items: center;
  visibility: hidden;
  opacity: 0;
  transition: all 0.4s;
  justify-content: center;
  &-success{
    background: #fff;
    position: relative;
    z-index: 200;
    max-width: 795px;
    width: 100%;
    padding-top: 50px;
    padding-bottom: 50px;
    .success-title{
      text-align: center;
      span{
        font-weight: 800;
        font-size: 25px;
        text-transform: uppercase;
        color: #000000;
        text-align: center;
      }
    }
  }
  &-wrapper{
    background: #fff;
    position: relative;
    z-index: 200;
    max-width: 795px;
    height: 90vh;
    overflow: hidden scroll;
    width: 100%;
    .callback-top{
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 20px 58px;
      flex-flow: row wrap;
      .top-close{
        width: 100%;
        text-align: right;
        padding-bottom: 20px;
        img{
          cursor: pointer;
        }
      }
      .top-title{
        span{
          font-weight: 800;
          font-size: 25px;
          text-transform: uppercase;
          color: #000000;
        }
      }
    }
    .callback-form{
      padding: 0 58px 58px;
      .form-input{
        margin-bottom: 30px;
        input{
          width: 100%;
          font-size: 18px;
          line-height: 18px;
          color: #171717;
          border: 0;
          border-bottom: 1px solid #171717;
          padding-bottom:6px;
          padding-top: 9px;
          &::placeholder{
            font-size: 18px;
            line-height:18px;
            color: #171717;
          }
        }
      }
      .form-textarea{
        margin-bottom: 30px;
        textarea{
          width: 100%;
          font-size: 18px;
          line-height: 18px;
          color: #171717;
          height: 22px;
          border: 0;
          border-bottom: 1px solid #171717;
          font-family: 'Muller';
          &::placeholder{
            font-size: 18px;
            line-height:18px;
            color: #171717;
            font-family: 'Muller';
          }
        }
      }
      .form-checkbox{
        .checkbox-title{
          padding-bottom: 36px;
          span{
            font-size: 20px;
            line-height: 20px;
          }
        }
        .checkbox-item{
          margin-bottom: 25px;
          > label{
            display: flex;
            flex-direction: row;
            cursor: pointer;
          }
          input[type="checkbox"]{
            display: none;
          }
          input[type="checkbox"]:checked{
            + label{
              .checkbox-item__check{
                span{
                  &::before{
                    opacity: 1 !important;
                  }
                }
              }
            }
          }
          &__name{
            flex: 1;
            padding-left: 15px;
            span{
              font-size: 20px;
              line-height: 20px;
              color: #171717;
            }
          }
          &__check{
            flex-basis: 18px;
            span{
              width: 17px;
              height: 17px;
              display: flex;
              content: '';
              position: relative;
              justify-content: center;
              align-items: center;
              border: 1px solid #000000;
              &::before{
                width: 11px;
                height: 11px;
                display: block;
                content: '';
                background: #F37137;
                transition: all 0.4s;
                opacity: 0;
              }
            }
          }
        }
      }
      .form-btn{
        margin-top: 42px;
        button{
          font-weight: 700;
          font-size: 16px;
          color: #171717;
          padding: 0;
          margin: 0;
          background: transparent;
          border: 0;
          position: relative;
          width: max-content;
          &:before{
            width: 0%;
            height: 5px;
            background: #171717;
            display: block;
            content: '';
            position: relative;
            top: -5px;
            transition: all 0.4s;
          }
          &:hover{
            &:before{
              width: 100%;
            }
          }
        }
      }
      .form-policy{
        margin-top: 24px;
        &__text{
          font-weight: 300;
          font-size: 16px;
          line-height: 16px;
          color: #979797;
          a{
            color: inherit;
          }
        }
      }
    }
  }
  &-bg{
    background: rgba(0,0,0,.5);
    position: absolute;
    left: 0;
    top: 0;
    width: 100%;
    height: 100%;
  }
}
@media (min-width: 1330px) and (max-width: 1470px) {
  .callback{
    &-wrapper{
      zoom: .8;
    }
  }
}
@media (max-width: 600px){
  .callback{
    max-width: 100%;
    &-success{
      width: 90%;
    }
    &-wrapper{
      max-width: 95%;
      height: 70vh;
      .callback-top{
        padding: 15px;
        .top-title{
          width: 70%;
          span{
            font-size: 20px;
          }
        }
        .top-img{
          width: 30%;
          img{
            max-width: 100%;
          }
        }
      }
      .callback-form{
        padding: 0 15px 15px;
        .form-input{
          margin-bottom: 20px;
          input{
            width: calc(100% - 20px);
          }
        }
        .form-textarea{
          textarea{
            border-radius: 0;
            appearance: none;
            height: auto;
            width: calc(100% - 20px);
          }
        }
        .form-policy{
          &__text{
            font-size: 15px;
          }
        }
      }
    }
  }
}
</style>
