<template>
  <div class="wrapper">
    <Header/>
    <h1>Policy information</h1>
    <div>
      <p>Настоящая Политика конфиденциальности персональных данных (далее &ndash; Политика конфиденциальности) действует в отношении всей информации, которую сайт ООО_официальное название компании_, расположенный на доменном имени www.__, может получить о Пользователе во время использования сайта www.__, программ и продуктов этого сайта.</p>
      <p>Мы собираем, используем и охраняем персональные данные, которые Вы предоставляете нам при использовании нашего сайта (далее &ndash; &laquo;сайт&raquo;) с любого устройства и при коммуникации с нами в любой форме, в соответствии с данной Политикой.</p>
      <p>Используя наш сайт и предоставляя нам свои персональные данные, Вы даете согласие на обработку Ваших персональных данных в соответствии с данной Политикой.</p>
      <p><strong>1. Основные понятия</strong></p>
      <p>&laquo;Персональные данные&raquo; &ndash; любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу.</p>
      <p>&laquo;Обработка персональных данных&raquo; &ndash; осуществление любых действий или совокупности действий в отношении Ваших персональных данных, включая сбор, запись, систематизацию, накопление, хранение, обновление и изменение, извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение, как с использованием, так и без использования систем автоматизированной обработки персональных данных.</p>
      <p><strong>2. Данные, которые мы собираем</strong></p>
      <p>Мы собираем:</p>
      <ul>
        <li>персональные данные, которые Вы предоставляете нам при заполнении информационных полей на нашем сайте, в том числе при заполнении контактной формы, при подписке на новостную рассылку, при регистрации на мероприятия;</li>
        <li>персональные данные и другую информацию, содержащуюся в сообщениях, которые Вы нам направляете;</li>
        <li>персональные данные, которые Вы предоставляете через наш сайт вакансий и стажировок;</li>
        <li>технические данные, которые автоматически передаются устройством, с помощью которого Вы используете наш сайт, в том числе технические характеристики устройства, IP-адрес, информация, сохраненная в файлах &laquo;cookies&raquo;, которые были отправлены на Ваше устройство, информация о браузере, дата и время доступа к сайту, адреса запрашиваемых страниц и иная подобная информация;</li>
        <li>иные данные о Вас, которые Вы пожелали оставить на нашем сайте.</li>
      </ul>
      <p><strong>3. Цели обработки данных</strong></p>
      <p>Мы обрабатываем Ваши персональные данные исключительно для тех целей, для которых они были предоставлены, в том числе:</p>
      <ul>
        <li>предоставления Вам информации о Компании, наших услугах и мероприятиях;</li>
        <li>осуществление приема и отправки заказа on-line;</li>
        <li>коммуникации с Вами, когда Вы обращаетесь к нам;</li>
        <li>организации Вашего участия в проводимых нами мероприятиях и опросах;</li>
        <li>направления Вам наших новостных материалов;</li>
        <li>выполнения полномочий и обязанностей, возложенных на Компанию законодательством Российской Федерации;</li>
        <li>для других целей с Вашего согласия.</li>
      </ul>
      <p>Мы обрабатываем технические данные для:</p>
      <ul>
        <li>обеспечения функционирования и безопасности нашем сайте;</li>
        <li>улучшения качества нашего сайта.</li>
      </ul>
      <p>Мы не размещаем Ваши персональные данные в общедоступных источниках. Мы не принимаем решений, порождающих для Вас юридические последствия или иным образом затрагивающих Ваши права и законные интересы на основании исключительно автоматизированной обработки персональных данных.</p>
      <p><strong>4. Ваши права</strong></p>
      <p>Обеспечение защиты Ваших прав и свобод в сфере персональных данных &ndash; важное условие работы Компании.</p>
      <p>Чтобы обеспечить защиту Ваших прав и свобод, по Вашей просьбе мы:</p>
      <ul>
        <li>подтвердим, обрабатываем ли мы Ваши персональные данные и предоставим Вам возможность с ними ознакомиться в течение 30 дней с даты получения Вашего запроса;</li>
        <li>сообщим Вам об источнике получения и составе Ваших персональных данных, которые мы обрабатываем;</li>
        <li>сообщим Вам о правовых основаниях, целях, сроках и способах обработки Ваших персональных данных;</li>
        <li>внесем необходимые изменения в Ваши персональные данные, если Вы подтвердите, что они неполные, неточные или неактуальные, в течение 7 рабочих дней с даты получения подтверждения, и уведомим Вас о внесенных изменениях;</li>
        <li>сообщим Вам об осуществленной или о предполагаемой трансграничной передаче Ваших персональных данных;</li>
        <li>сообщим Вам наименование и место нахождения организаций, которые имеют доступ к Вашим персональным данным и которым могут быть раскрыты Ваши персональные данные с Вашего согласия;</li>
        <li>сообщим Вам наименование или фамилию, имя, отчество и адрес лиц, которым с Вашего согласия может быть поручена обработка Ваших персональных данных; уведомим Вас о порядке осуществления Ваших прав при обработке нами Ваших персональных данных;</li>
        <li>исключим Вас из рассылки наших новостных материалов;</li>
        <li>прекратим обработку Ваших персональных данных в течение 30 дней с даты получения отзыва согласия, если для обработки персональных данных не будет иных правовых оснований, предусмотренных законодательством Российской Федерации;</li>
        <li>прекратим обработку Ваших персональных данных, если будет подтверждено, что мы их обрабатываем неправомерно, и уведомим Вас о предпринятых мерах;</li>
        <li>уничтожим Ваши персональные данные, если будет подтверждено, что они незаконно получены или не соответствуют заявленным целям обработки, в течение 7 рабочих дней с даты получения соответствующего подтверждения, и уведомим Вас о предпринятых мерах;</li>
        <li>ответим на Ваши вопросы, касающиеся Ваших персональных данных, которые мы обрабатываем.</li>
      </ul>
      <p><strong>5. Как Вы можете связаться с нами</strong></p>
      <p>Вы можете обратиться к нам с запросом, касающимся обработки Ваших персональных данных, направив нам письмо через форму обратной связи с темой письма &laquo;Запрос о персональных данных&raquo; (либо &laquo;Отзыв согласия на обработку персональных данных&raquo; в случае отзыва согласия на обработку персональных данных).</p>
      <p><strong>6. Безопасность персональных данных</strong></p>
      <p>Для обеспечения безопасности Ваших персональных данных при их обработке мы принимаем необходимые и достаточные правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, их уничтожения, изменения, блокирования, копирования, предоставления, распространения, а также от иных неправомерных действий в отношении персональных данных.</p>
      <p>В целях обеспечения адекватной защиты Ваших персональных данных мы проводим оценку вреда, который может быть причинен в случае нарушения безопасности Ваших персональных данных, а также определяем актуальные угрозы безопасности Ваших персональных данных при их обработке в информационных системах персональных данных.</p>
      <p>В Компании приняты локальные акты по вопросам безопасности персональных данных. Сотрудники Компании, имеющие доступ к персональным данным, ознакомлены с настоящей Политикой и локальными актами по вопросам безопасности персональных данных.</p>
      <p><strong>7. Прекращение обработки персональных данных</strong></p>
      <p>Мы прекращаем обработку Ваших персональных данных:</p>
      <ul>
        <li>при наступлении условий прекращения обработки персональных данных или по истечении установленных сроков;</li>
        <li>по достижении целей их обработки либо в случае утраты необходимости в достижении этих целей;</li>
        <li>по Вашему требованию, если обрабатываемые персональные данные являются незаконно полученными или не являются необходимыми для заявленной цели обработки;</li>
        <li>в случае выявления неправомерной обработки персональных данных, если обеспечить правомерность обработки невозможно;</li>
        <li>по истечении срока действия Вашего согласия на обработку персональных данных или в случае отзыва Вами такого согласия, если для обработки персональных данных не будет иных правовых оснований, предусмотренных законодательством Российской Федерации; в случае ликвидации Компании.</li>
      </ul>
      <p><strong>8. Cookies</strong></p>
      <p>Мы используем файлы &laquo;cookies&raquo;. Файлы &laquo;cookies&raquo; &ndash; это небольшие текстовые файлы, размещаемые на жестких дисках Ваших устройств во время использования различных сайтов, предназначенные для содействия в настройке пользовательского интерфейса в соответствии с Вашими предпочтениями.</p>
      <p>Большинство браузеров позволяют отказаться от получения файлов &laquo;cookies&raquo; и удалить их с жесткого диска устройства.</p>
      <p><strong>9. Ссылки на сайты третьих лиц</strong></p>
      <p>На нашем сайте могут быть размещены ссылки на сторонние сайты и службы, которые мы не контролируем. Мы не несем ответственности за безопасность или конфиденциальность любой информации, собираемой сторонними сайтами или службами.</p>
      <p><strong>10. Изменение Политики</strong></p>
      <p>Мы можем обновлять Политику по мере необходимости. Мы рекомендуем Вам периодически проверять актуальность данной Политики. Продолжая пользоваться нашим сайтом после изменения Политики, Вы подтверждаете согласие с внесенными изменениями.</p>
    </div>
  </div>
</template>

<script>

import Header from "~/components/Header";

export default {
  name: "policy",
  components: {
    Header
  }
}
</script>

<style scoped>

</style>
